{
  "given": [
    {
      "recommender_name": "Elyza Bleau",
      "recommender_title_company": "October 18, 2023, Joe managed Elyza directly",
      "text": "I have had the pleasure of working with Elyza as her direct manager since late 2019. We collaborate regularly on various projects and have bi-weekly one-on-one meetings since she started her role at iCIMS. Elyza is an active knowledge seeker who is not satisfied with just meeting the status quo. She seeks out internal training resources and obtains external certifications to further her professional growth. Notably, she has earned the \"User Experience Interaction Design\" certification from Nielsen Norman Group and the \"Google UX Design\" certificate from Coursera. I like to think of Elyza as a professional superhero of sorts. Front-end developer by day, UX designer/artist by night. To cap it off, she is a talented musical and digital artist, with a prolific portfolio! Examples of her work are publically abundant, but I recommend starting with her Youtube or Socials. Elyza is passionate about accessibility and language; she has gone above and beyond to optimize our software for both initiatives. She conducts thorough audits of our applications, ensuring seamless accessibility for all individuals, regardless of their abilities. Her dedication to inclusivity is inspiring. She is personally involved with the \"Women Who Code\" organization and serves as the voice of these viewpoints on our team. She has the potential to make significant contributions to advancing inclusive software development. In addition to Elyza's technical skills and creative abilities, her personality and character make her an ideal candidate. She is easy to work with, outgoing, and always willing to lend a helping hand. Elyza reduces barriers by seeking support and asking for help when needed. Her ability to ask thoughtful questions allows her to clarify any concerns or confusion, ensuring that she completes tasks accurately and efficiently. Elyza's passion, combined with her range of abilities and remarkable dedication to inclusivity, make her an excellent prospect for any engineering or design teams.",
      "date": "October 18, 2023, Joe managed Elyza directly"
    },
    {
      "recommender_name": "Narmadha Viswanathan",
      "recommender_title_company": "Senior Software Engineer at iCIMS",
      "text": "I have had the pleasure to know and work with Narmadha for a little over two years. In this time, I have both developed software together with her, and managed her directly. Narmadha is a pragmatic backend engineer who has taken the lead on a variety of problems in our company. In her time at iCIMS, I've watched as she quickly learned several different codebases and started contributing almost immediately. Since she has joined, she has continued to help build scalable software and improve the performance of our existing systems. She is able to evaluate our deployed services and provides meaningful suggestions on how to make them better. She has no problem taking ownership of the products she works on. Narmadha is able to thrive in both individual and group settings. She has purposeful conversations with our product managers to understand all of our customer requirements. Once tickets are created, she works to deliver software that meets/exceeds those goals. Additionally, she has recently taken on new responsibilities to help mentor developers in our H-Lab program. She provides technical guidance, leadership, and also helps to get them onboarded and up to speed on different parts of our stack. Narmadha Viswanthan is a valued member of our team whom we have learned we can rely on, regardless of the complexity of the task or the unfamiliarity of the challenge at hand.",
      "date": "July 8, 2021, Joe managed Narmadha directly"
    },
    {
      "recommender_name": "Boris Kozak",
      "recommender_title_company": "Engineering @ Instagram, nonprofit director, Rutgers sponsor instructor, UMD alum #goterps",
      "text": "Boris is an exemplary, easy to work with manager. Since I first started at Jibe (and through our iCIMS acquisition), interacting with him has been one of my favorite parts of my job. He is approachable, amenable, and helpful when removing/resolving blockers for people in his organization. Although Boris is mostly removed from IC work at this point in his career, he still maintains a high technical acumen and ability. He has a thorough understanding of the systems in his purview and can call out potential tripping points before they occur. If you ask anyone on our development team who knows a little bit of everything in the tech stack, the answer is invariably Boris. Additionally, Boris is extremely passionate about his job. He is interested in delivering a superior product across the board, and keeping the organization running in an optimal fashion. He clearly loves the work he does, and the people he works with. Speaking as one of his direct reports, I appreciate the candor I can have with him in all our interactions. I never feel like I have to \"pull punches\" which makes it easier and faster to get work done together. He is extremely receptive to ideas I bring up in our discussions and has been effective at putting them into practice. Finally, Boris has been a great mentor and has taught me what it takes to be a strong leader. He is knowledgeable in dealing with various managerial situations that may arise and helping coach through these types of events. I regularly learn from his techniques, and value our discussions around these points. Boris was an integral part of my overall positive experience at iCIMS, and I will sorely miss having him as a manager. I hope we get to work together again in the near future.",
      "date": "February 25, 2021, Joe reported directly to Boris"
    },
    {
      "recommender_name": "Josh Mazen",
      "recommender_title_company": "AI Software Engineer",
      "text": "Josh is an energetic problem solver who is happy to dive head first into technical issues of all kinds. During the time I managed him directly, I observed Josh tackle some of the most challenging issues on our team. Oftentimes, he is tasked with figuring out solutions that necessitated formulating new design patterns and deep-dives into documentation and foreign codebases. Additionally, Josh is able to boost up those around him. His enthusiasm is infectious, and I believe it inspires the teams he is on. He is charismatic, funny, and able to connect on a personal level with his cohorts. Although most software engineers I’ve worked with lean more towards the reserved side, Josh bucks this trend and is a lively participant in any group setting. Josh is a leader in modernizing our NodeJS application layer. He fought to utilize cutting-edge frameworks (like NestJS) which brings TypeScript and observables to this part of the codebase. He dedicated many cycles to integrating object oriented concepts that greatly improved organization at this level of our stack. Additionally, he refined our caching mechanism, providing speed and performance gains that benefited our customers. He continues to strive towards writing testable, maintainable code. Josh consistently delivers high-quality software for iCIMS. This speaks to his overall intellect and ability to learn, attributes that will serve him well in any engineering role.",
      "date": "November 30, 2020, Joe managed Josh directly"
    },
    {
      "recommender_name": "Lori Lombert",
      "recommender_title_company": "Director, Software Engineering at The Walt Disney Company",
      "text": "Lori has been one of the most important pillars of Marvel software for years. Since she joined the team, she has done a phenomenal job of shepherding a traditional media business to a hybrid business with many complex digital product offerings. Most of this highly-functioning infrastructure can be attributed to her watchful eye and experienced guiding hand. From the beginning of my time as a Marvel employee I quickly realized that whenever I had a question, Lori was usually the person with a clear, quick answer. She had her hand in every part of the Marvel stack and her knowledge spanned all of our products. I was able to work through some of the odd outskirts of our code base purely based on her knowledgeable coaching. Behind the scenes, I consistently trusted Lori to accurately represent our software team's needs and standards in cross-functional meetings. Although I wasn't always a part of those decision-laden discussions, I felt confident that Lori would help craft a solution that was a healthy marriage of the business' and our team's needs. Lori was a rare combination of an excellent software engineer, diligent manager, and extremely hard worker all rolled into one. I know our digital applications will continue to thrive with her at the helm.",
      "date": "August 14, 2018, Lori was senior to Joe but didn't manage Joe directly"
    },
    {
      "recommender_name": "Jazzy Guo",
      "recommender_title_company": "Software Engineer",
      "text": "Jazzy joined my small team in a recent class of Marvel interns. From the moment the front end engineers interviewed Jazzy, we knew he would be an excellent addition. Jazzy came on to the team with an extremely high knowledge of React. He was able to hit the ground running, and quickly became a core contributor to our projects. Although he started out with simple bug fixes, Jazzy quickly progressed to taking on more challenging features and building new components. By the end of his tenure, I looked at him more as a core team member than a novice intern. I was able to assign him open-ended problems and watch as he crafted creative and thoughtful solutions to each one of them. I was also impressed at the amount of work he was able to churn through in a short amount of time. Although he is new to the industry, I think Jazzy would make a great addition to any front-end software team.",
      "date": "August 7, 2018, Joe managed Jazzy directly"
    },
    {
      "recommender_name": "Elliot Ronen",
      "recommender_title_company": "August 7, 2018, Joe worked with Elliot on the same team",
      "text": "Elliot was one of the best product managers I've ever worked with. During my time at Marvel, he and I collaborated on several projects together, all of which were delivered stable and on-time; which is the golden metric in any software application. Much of our success can be attributed to Elliot's diligence in the preparation phase. Most of the projects we ultimately shipped started out purely as his brain children. Elliot used his astute observational skills to spot problem areas of our editorial team's workflows. From here, he was able to create thoughtful software solutions to boost efficiency in these areas. By the time I was on-boarded to his projects, Elliot had created well-written, clearly defined user stories that were extremely easy to decipher and work through. He thoughtfully separated stories into digestible chunks and allowed the developers to fill in the gaps with their own creativity. When the initial proposed solutions needed to be adjusted, he was very willing to work through alternatives to find a happy medium. He also had a keen eye towards the end user- always ensuring that his software provided a frictionless UI. Overall, it was a pleasure working with Elliot. As long as he is highly involved in Marvel's software life cycle, the company will continue to churn out stellar digital products.",
      "date": "August 7, 2018, Joe worked with Elliot on the same team"
    },
    {
      "recommender_name": "Matthew Smith",
      "recommender_title_company": "Engineering Manager • Front-End Developer • Emoji Connoisseur ☀️ React • JavaScript • CSS",
      "text": "Matthew was my direct manager for the latter end of my tenure at Marvel. During our time working together, I found him to be a very helpful and very straight-forward manager. I always felt like he had my back and accurately represented my needs to the higher-ups. Our weekly one-on-ones quickly became a safe space for me to voice any concerns I saw at the code-level, management level, or culture level. His years of front end engineering experience also made him an excellent teammate to talk shop with. He was always able to provide thoughtful guidance for any hiccups that arose in our development lifecycle. Whenever a real concern came up, Matthew was quick to nip any problems in the bud. He effectively communicated any concerns to relevant stakeholders- almost always resulting in a solution that worked for all parties involved. I enjoyed our time working together, and know the front-end team is in good hands with him leading the charge.",
      "date": "August 7, 2018, Joe reported directly to Matthew"
    },
    {
      "recommender_name": "Sharmin Kazi",
      "recommender_title_company": "August 7, 2018, Joe worked with Sharmin on the same team",
      "text": "Sharmin and I worked together for the majority of my tenure at Marvel. During that time, we churned through many new features, bug fixes and user stories together spanning several different projects. We developed an extremely efficient workflow, as we made sure features were stable and battle-tested. She was awesome to work with, and very thorough in her testing. Even though I always did my best to test my work before kicking it over the fence, I knew I could count on her to make sure everything was production-ready. When issues did arise, Sharmin described the reproduction steps comprehensively on her tickets. She was skilled at using all the tools at her disposal to provide helpful insight on her tickets. On the occasion when I was unclear on how to recreate a defect, she was always just a quick slack message away. I would highly recommend her as a stellar addition to any software development team.",
      "date": "August 7, 2018, Joe worked with Sharmin on the same team"
    },
    {
      "recommender_name": "Alan Wong",
      "recommender_title_company": "Senior Software Engineer at Walt Disney Direct-to-Consumer & International",
      "text": "I was lucky enough to work with Alan on the most recent overhaul of Marvel.com. From the moment he was brought on at the project's inception, Alan was a consummate professional. As soon as the tickets started to roll in, Alan happily took on his share of the work and more. He quickly churned through his biweekly load, and produced some of the site's most prominent components with ease. His code was never overly complicated. It was always well organized and commented, as well as easy to read. He produced source code that could only be output by a seasoned senior javascript developer. On an interpersonal level, Alan was a pleasure to work with. He was extremely easy to bounce ideas off and was always there for a good round of rubber ducking. He quickly spotted bugs with keen precision and was often able to lend a helping hand. The site would not be in the stable, scalable place it is today without his help. I hope to work on a large software project with him again at some point soon.",
      "date": "August 7, 2018, Joe worked with Alan on the same team"
    },
    {
      "recommender_name": "Dave Bokil",
      "recommender_title_company": "Director of Product at National Basketball Players Association (NBPA)",
      "text": "Dave is an extraordinary student, and an even better programmer. From his first moment typing an HTML tag, up until his impressive full-stack MERN-based final project, he made a habit of continually impressing everyone in the room. He has the ability to ask very pointed and expository questions that aid the understanding of everyone around him. Since he is generally outgoing, he is not afraid to be on the forefront of learning; cutting through the weeds and blazing a trail for others to follow in. Dave has an eye for UI, and a very keen ability to create beautiful web pages with ease. Layouts and styling seem to come very naturally to him. Additionally, he navigates a computer at breakneck speeds, and can type extremely fast. His efficiency on a mac is staggering. Dave comes to class with an eagerness to learn, and I have no doubt would bring the same voracious nature to any professional position. I enthusiastically endorse him for a role on any development team, and recommend you strongly consider him.",
      "date": "August 3, 2017, Joe was Dave’s teacher"
    },
    {
      "recommender_name": "Diaeddin Motan",
      "recommender_title_company": "Software Engineer at JPMorgan Chase & Co.",
      "text": "I had the pleasure of having Dean as a student in my most recent cohort. He was one of the most gifted people in class, and continually impressed me with both his day to day and project work. During class activities, it was not uncommon to see Dean finished early, helping students next to him understand the topic at hand. He is friendly, and happy to aid anyone in need of assistance. Some of the best projects that came out of our cohort had one common factor: Mr. Motan. It seemed that his groups always produced quality, above-par products. I have no doubt he was a strong contributing force in this effort. Although Dean was a great team player, he was also ruthlessly efficient when left to tackle a problem alone. He had a knack for finding coherent, relevant answers to problems with only a search engine. I believe this is an invaluable skill sometimes found only in seasoned developers. The fact that Dean was capable of handling issues like this speaks volumes of his real-world abilities. Dean is a terrific developer and would definitely be a major asset to any technical team. Please consider him in your hiring process!",
      "date": "August 2, 2017, Joe was Diaeddin’s teacher"
    },
    {
      "recommender_name": "Hima Unnithan",
      "recommender_title_company": "Vice President at JPMorgan Chase & Co.",
      "text": "Hima has really excelled in the Rutgers Coding Bootcamp. She has proved herself to be one of the most skilled and determined developers in the class. She is always pushing herself to become better, and will not rest until she has a thorough understanding of a topic. She has asked some of the most well formed questions of the cohort, and often pushes me to be a more effective and strategical instructor. I feel like I've become a stronger developer trying to convey complex topics thoroughly to her. Hima has also proved that she is skilled at mentorship at many points throughout our cohort. I've seen students fight over the spot next to her because she is so willing to help out her classmates. She is patient and thorough with her explanations, and will never say no to a developer in need. She is quick-witted, and pays keen attention to detail. These two skills make her very skilled at the craft of writing code. She produces nothing but quality work, and stands behind her sites and the hours poured into them. I have no doubt that she would make a great addition to any engineering team.",
      "date": "June 26, 2017, Joe was Hima’s teacher"
    },
    {
      "recommender_name": "James Larkin",
      "recommender_title_company": "June 26, 2017, Joe was James’ teacher",
      "text": "It's been a pleasure having James in my Rutgers Coding Bootcamp cohort. He's a terrific student, and a very quick learner. Additionally, I believe he's become a valuable asset to the class dynamic. His expository questions help bolster his classmates' understanding, and indicate a rapidly expanding knowledge across the tech stack. He has continued to produce quality work throughout the semester. This work ranges from simple jQuery games, all the way to advanced full-stack applications complete with their own APIs and advanced database connections. I have no doubt he would be able to tackle a myriad of technical problems with an adept hand. James has also shown interest and skill at helping his peers. During class activities, he can be found discussing some of the more complex topics with others in the room, eager to share some of his new found knowledge. I believe these communication skills would translate well in a professional setting. Any companies considering him for employment would be lucky to have him onboard.",
      "date": "June 26, 2017, Joe was James’ teacher"
    },
    {
      "recommender_name": "Craig Ramey",
      "recommender_title_company": "Staff Software Engineer at Zip Co",
      "text": "Craig has been an excellent Teaching Assistant during the course of our cohort. At this point, I look at him more like a co-teacher than a TA. He is extremely knowledgeable about all things regarding web development, and consistently provides extra information to our students on a variety of topics. He has been able to form lasting connections with many of our students. He personally checks in with several people on a weekly basis, ensuring that they have a good grasp on the course material, and answering any questions they may have. His rapport is a reflection on his genuine love of both the material and the learning process. Additionally, Craig has been key in a support role, as he has taken ownership of managing the class’ github repo. He is a vital resource on our Slack channel, and is quick to assist student’s questions in a timely fashion. He also is responsible for a lot of the communication on Slack during class. He will direct flow of the activities, and answer any in-depth questions that land in our parking-lot channel. Craig would be an excellent addition to any team, and is knowledgeable enough to tackle a variety of roles pertaining to creating/deploying websites. I strongly suggest you consider him for your role. Your site will be in good hands if Craig is at the helm.",
      "date": "June 16, 2017, Joe managed Craig directly"
    },
    {
      "recommender_name": "Ben Ratner",
      "recommender_title_company": "Android Engineer at Peloton Interactive",
      "text": "It was an absolute pleasure having Ben as an web development intern at Marvel. We were lucky enough to have him on board for an eight month stint; much longer than any other college level development intern we've taken in the past. During his time here, Ben excelled at any work we put in front of him. He started off by cleaning up a dated CSS codebase, and quickly familiarized himself with our styleguide. He learned Sass on the job, and shortly therafter was able to produce production-ready code heavily utilizing it. After proving himself in the Sass rewrite project, Ben was added as a key developer on our internal promo creation tool team. The project went through three [drastically different] phases, transitioning from jQuery to ES5-style ReactJS, and finally to ES6 [class based] ReactJS. To tackle this gargantuan effort, Ben spent hours steeped in online resources, working alongside fellow engineers, and coding side projects that utilized the framework. Once he felt comfortable with all of this brand new technology, Ben jumped in head-first. He was able to effectively handle bug fixes, major stylistic changes, and even created some of the app's most complex components from scratch. He also assisted with deciphering and stabilizing the webpack configuration for the project, which leveraged a complex build chain. He was vital to the project's success, and instrumental in coding one of the company's cleanest, most current/future-facing codebases. Ben is wise beyond his age. He codes with the instinct of a developer who has been in the field for many years. He is able to quickly digest any technologies that he encounters, and become proficient at them in an incredibly short time. He is also well-spoken, and can explain complex concepts in an understandable manner. He is an extremely talented engineer, and would be an extraordinary asset to any web development team.",
      "date": "April 20, 2017, Joe managed Ben directly"
    }
  ],
  "received": [
    {
      "recommender_name": "Matthew Moran",
      "recommender_title_company": "Backend Software Engineer at Noom",
      "text": "I had the pleasure of working with Joe for over five years at iCIMS. I began my career as an intern on Joe's team, and he remained my manager. Joe's technical background made him an exceptional manager since he truly understood the intricacies of our work. He knew each team member's strengths and how to position us effectively during development, which helped keep the team focused on high-impact projects. When projects were taking too long or weren't worth the development effort, Joe knew exactly when to step in and provide guidance.Joe's dedication to our team was unmatched. Even as his responsibilities expanded to managing multiple teams, he always made time for one-on-one meetings, ensuring I received the support and mentorship I needed. He was a strong advocate for all of us, consistently highlighting our contributions to upper management. Personally, Joe played a huge role in shaping my career, offering invaluable advice on how to grow in the software engineering field.Joe's leadership was a key factor in our team's success. He had the ability to balance deep technical insight with a genuine focus on employee development, making him an outstanding leader. I'm grateful for everything I learned from him, and any team would be lucky to have him.",
      "date": "September 9, 2024, Matthew reported directly to Joe",
      "priority": 9
    },
    {
      "recommender_name": "Alex Wong",
      "recommender_title_company": "Software Architect at iCIMS",
      "text": "I had the pleasure of working with and growing with Joe, leading our portfolio of recruitment marketing software during his time at iCIMS. I personally saw the impact of his charisma, empathy, and leadership by the strengthening of his teams. His engineering background and personality gives him a knack on how to connect to the people he works with. Joe's ability to make strategic decisions and bring together key people made a significant difference in the success of our organization. His guidance and insight are invaluable, and I'm confident that any team he joins will benefit greatly from his leadership. I would be considerably happy to work with Joe again.",
      "date": "August 28, 2024, Alex worked with Joe on the same team",
      "priority": 8
    },
    {
      "recommender_name": "Abuzar Amini",
      "recommender_title_company": "VP, Engineering @ iCIMS | Startup Founder | ex-Apple",
      "text": "It was an absolute privilege to have Joe as a direct report. He is a rare engineering leader who excels in both fast-paced startup environments and larger, more structured enterprises. Throughout our time working together, I witnessed his evolution from a hands-on engineering manager to a director with a significantly expanded scope of responsibility. In every stage of his growth, Joe consistently prioritized the well-being and development of his team while ensuring alignment with the overarching business goals.",
      "date": "August 23, 2024, Abuzar managed Joe directly",
      "priority": 10
    },
    {
      "recommender_name": "Balaji V M",
      "recommender_title_company": "Principal Software Engineer at iCIMS",
      "text": "Joe is an excellent, highly skilled, and knowledgeable manager. I have been working under his supervision for three years now. He sets realistic goals and gives reasonable deadlines to complete those goals. In addition, he is a good listener who always pays attention to the details. His understanding of people's needs is outstanding, so much so that everyone working under him feels comfortable. On top of that, Joe is a great motivator. He instills positive energy in every team member, keeping everyone focused on what needs to be achieved.Joe is not only friendly and helpful but also goes above and beyond to maintain the team spirit. Moreover, I have seen him working his way through numerous challenges and crises with a calm demeanor. He prioritizes quick responses to ensure a tight feedback loop with anyone he's working with, regardless of the topic at hand. I feel proud to have worked under his guidance, and I strongly recommend him for any engineering management position.",
      "date": "August 17, 2024, Balaji reported directly to Joe",
      "priority": 8
    },
    {
      "recommender_name": "Alex Schlumpf",
      "recommender_title_company": "Senior Software Engineer at HubSpot",
      "text": "Joe exemplifies what it means to be a leader of a team. I can attribute the opportunities for growth in my career to the responsibilities and challenges that Joe entrusted me with. I always felt comfortable discussing my technical opinions and project pain-points with Joe, as he has strong instincts for how to turn blockers into autonomous, repeatable processes. The trust we shared empowered me to take a lead in delivering to the deadlines for our products, and supporting our internal stakeholders and customers of our platform. In our time together, Joe developed me from an intern to a senior engineer. It was made clear to me early on that if I focused on delivering to the expectations of my role and beyond, Joe would work hard on the back end to promote my career growth. Joe's support and encouragement to always state my opinion in meetings is just one example of how he always had my back as his direct. I am truly thankful to Joe for being a driving force in my career development.",
      "date": "August 8, 2024, Alex reported directly to Joe",
      "priority": 8
    },
    {
      "recommender_name": "Matteo Hernandez",
      "recommender_title_company": "Senior Product Manager at iCIMS",
      "text": "I have worked with Joe directly for 3 years as his product counterpart. Joe is the complete package – technical, analytical, rational, and methodical, but also empathetic, easy-going, well-spoken, and a good listener. He always cuts right to the heart of every problem and effectively balances attention to detail with getting stuff done. He truly cares about his people. His professional opinions are of very high value.",
      "date": "August 1, 2024, Joe was senior to Matteo but didn't manage Matteo directly",
      "priority": 7
    },
    {
      "recommender_name": "Elyza Bleau",
      "recommender_title_company": "November 7, 2023, Elyza reported directly to Joe",
      "text": "Since late 2019, Joe has served as my direct manager, and I've been consistently impressed by his supportive and dedicated approach. He actively engages in bi-weekly one-on-one meetings and tailors our discussions to align with my unique career aspirations.Throughout his tenure at iCIMS, Joe has consistently demonstrated exemplary leadership and has progressed within the company. He maintains a keen awareness of ongoing developments, ensuring that his team stays informed and involved as necessary. I was happy Joe took a chance on me when I transitioned into the software development field and his guidance has been invaluable. Even amid the shift to remote work, he has kept strong and effective communication practices.As my manager, Joe demonstrates a genuine commitment to understanding my needs to help my experience as an individual contributor. He values my input and ensures that my opinions are heard—an aspect that's often rare in corporate settings. I recently approached him feeling uncertain about my role within my team and the company compared to my career goals. Joe listened attentively and worked with me to find constructive solutions. His ability to dissect the details, seek further clarification, and subsequently address my concerns left me feeling heard and satisfied with the result. Joe's proficiency in software engineering, coupled with his expanding communication skills, shines brilliantly in his role as a director. Under his guidance, I have thrived as an individual contributor.Joe's exceptional technical acumen, interpersonal skills, and dedication to discerning the priorities within each team he manages make him an outstanding engineering director—a true asset to any company.",
      "date": "November 7, 2023, Elyza reported directly to Joe",
      "priority": 7
    },
    {
      "recommender_name": "Brian Parrish",
      "recommender_title_company": "Staff Software Engineer @ Fora",
      "text": "Joe and I built fullstack web applications together for multiple years while navigating team changes, company acquisitions, and large shifts in processes and personnel. Throughout all of these challenges, I always felt organized, supported, and prioritized not only as a team member but as an individual. I began working with Joe as a junior engineer and worked under his leadership until a senior designation, and I have tremendous appreciation for his significant role in my development as a professional. He was patient and supportive, and was never afraid to give me opportunities to challenge myself and have an impact on the team, which helped me tremendously in growing as an engineer. Joe is an empathetic and brilliant manager who's positive impacts on products, teams, individuals, and the business as a whole are immeasurable.",
      "date": "June 15, 2022, Brian reported directly to Joe",
      "priority": 9
    },
    {
      "recommender_name": "Narmadha Viswanathan",
      "recommender_title_company": "Senior Software Engineer at iCIMS",
      "text": "I have had the pleasure of working with Joe for two years and directly reporting to him for a couple of months now. During my initial months at Jibe (later acquired by iCIMS) he helped get me up to speed with front end technologies. He is always available to provide support, and always answers my questions patiently. Joe is an excellent manager. He ensures that his teams are comfortable and does everything he can to help us when we hit any type of roadblock. He makes sure we have all the required resources to get our work done. Joe is also exceptional at backing his teams during a crisis. When things do not go as planned, he is able to communicate effectively with the team responsible for fixing the issue and the affected stakeholders. His levelheadedness in these situations is a useful tool to help decisively remediate any outages that occur. It is a breeze working under Joe. I have never felt any pressure or stress in the months I have spent as his direct report. He is patient and eager to listen to any concerns I have in our 1:1 meetings. He is always open to my suggestions and can implement them in short order. He checks if we need help on a personal level as well which is amazing. I am glad I've had the opportunity to work with him and I am looking forward to doing outstanding work at iCIMS together in the future.",
      "date": "July 23, 2021, Narmadha reported directly to Joe",
      "priority": 7
    },
    {
      "recommender_name": "Boris Kozak",
      "recommender_title_company": "Engineering @ Instagram, nonprofit director, Rutgers sponsor instructor, UMD alum #goterps",
      "text": "Joe is one of the most talented engineering leaders that I've had the pleasure of managing and mentoring.Joe empowers his teams to unlock their full potential and maximize their performance. He possesses a rare combination of being an exceptional individual contributor, a strong technical manager, and an inspiring people motivator. He has the ability to oversee a project and its constituent initiatives from start to finish. This includes allocating and budgeting resources, coordinating communication across multiple teams, and ensuring that important deadlines are met. His prowess for thriving in ambiguity is an immeasurable asset to our engineering organization. In our time working together, Joe managed multiple teams and workstreams and collaborated cross-functionally to deliver software that spanned numerous portfolios. Joe is an active conversation starter, calls out roadblocks as they arise, and autonomously does the work necessary to keep his teams unhindered so they can focus on coding. Because of this, Joe's teams were consistently some of the highest velocity teams in the organization. When his teams achieve noteworthy milestones, Joe is diligent to celebrate shared wins, driving overall morale and portfolio success. Additionally, Joe is prompt and available for discussion, not only to the team but to everyone in the business.In my one on ones with Joe, I was consistently impressed with how he makes both small and large tweaks within his workforce, shifting resources to accommodate constantly changing business priorities. He leverages his teams' individual strengths, efficiently delegates work and combines their contributions to deliver remarkable output.On the ground level, Joe was the catalyst to fundamentally changing (for the better) the way that his team thought about unit test coverage, accessibility, and internationalization. Joe rallied his team behind all of these concepts, and was able to bring his software portfolios to enterprise-grade readiness.I was always impressed with Joe's continuous educational investment in himself and his team members. Joe is a lifelong learner, always looking for new ways to grow his skills and keep on top of his profession. Outside work hours, he would opt into both technical and managerial training sessions via podcasts and educational videos. It's clear that Joe not only creates software for a day job, but absorbs any content that he can get his hands on to make himself a stronger people and technical manager.A role model for collaboration and creative problem-solving, Joe was always highly regarded by both his direct reports and senior leaders at Jibe and iCIMS. It's been a career highlight working with Joe, and I hope we get to work together again in the future.",
      "date": "March 17, 2021, Boris managed Joe directly",
      "priority": 10
    },
    {
      "recommender_name": "Josh Mazen",
      "recommender_title_company": "AI Software Engineer",
      "text": "Joe is not only an excellent programmer, he is a compassionate manager, a thoughtful leader, and a great mentor. On day 1, he came into the Jibe office and was able to grasp an unfamiliar tech stack with ease. He picked up the nuances of Angular extremely quickly and was even able to wire up a custom-built hybrid AngularJS/Angular bundle. His curiosity goes beyond \"What can I do to get the job done\"; he genuinely wants a deep understanding of the technology with which he works. At any point, Joe has been able to accommodate my own questions ranging from implementation best practices to career goals. He advocates for his fellow engineers and helps drive conversations with stakeholders to an understanding of the challenges we face in building and maintaining our architecture. His expectations are always high but reasonable, and he will never shy away from praise or constructive criticism. He continues to inspire his employees, myself included, to reach higher and assume more responsibility when the opportunity presents itself. Joe is a phenomenal co-worker, and my career would not be the same were he not in it.",
      "date": "December 1, 2020, Josh managed Joe directly",
      "priority": 7
    },
    {
      "recommender_name": "Matthew Smith",
      "recommender_title_company": "Engineering Manager • Front-End Developer • Emoji Connoisseur ☀️ React • JavaScript • CSS",
      "text": "Joe fearlessly led the charge toward new technologies and techniques across a number of high-profile Marvel projects. His involvement proved foundational in getting the new marvel.com underway, and our team benefited greatly from his trailblazing. Joe has proven time and again to dive headfirst into projects and has never shied away from getting his hands dirty in any front-end task asked of him. I greatly valued his input and welcomed his new efforts in leadership and mentoring on top of his development work.",
      "date": "September 29, 2019, Matthew managed Joe directly",
      "priority": 8
    },
    {
      "recommender_name": "Sharmin Kazi",
      "recommender_title_company": "August 9, 2018, Sharmin worked with Joe on the same team",
      "text": "I had the pleasure of working with Joseph at Marvel for about two years on various projects. During this time, I was always impressed with how diligent he was with his work. I've tested both small and large tickets and projects that Joseph worked on and always found that the work was thorough and consistently well documented. Joseph always goes beyond his role as a Developer and makes sure to communicate clearly and thinks about the larger picture. As a result, my testing of his work rarely ever yielded major issues. Joseph is someone who carries the team towards success with his diligence, attention to detail, and ability to cooperate constructively.",
      "date": "August 9, 2018, Sharmin worked with Joe on the same team",
      "priority": 6
    },
    {
      "recommender_name": "Jazzy Guo",
      "recommender_title_company": "Software Engineer",
      "text": "During my Frontend Development internship at Marvel, I had the pleasure of working under Joe, who was the Senior Frontend at the time. He provided me with patience and understanding, and really helped me reach my potential under his supervision. He was always available when I needed assistance, and always gave good support.Under Joe's management, I was able to hone my skills with React, and my passion for the field was simply strengthened by his own passion for coding. He was not afraid of giving me tasks that seemed out of my league, but that really shows his faith in his juniors – which I thank him highly for. Overall, Joe is excellent at supervision and is a superb teacher. I would be honored to work with him again someday and I would highly recommend him to any team looking for a lead developer.",
      "date": "August 9, 2018, Jazzy reported directly to Joe",
      "priority": 6
    },
    {
      "recommender_name": "Alan Wong",
      "recommender_title_company": "Senior Software Engineer at Walt Disney Direct-to-Consumer & International",
      "text": "Working with Joe was great. Very open to ideas while standing his ground on what he believed in. Passionate without the attitude. You learn a lot about a developer when you are in the trenches with him/her. Especially when working on a redesign of a new site from the bottom up. Ideas will clash and problems will arise. I am glad Joe was around throughout the life of the project.",
      "date": "July 18, 2018, Alan worked with Joe on the same team",
      "priority": 6
    },
    {
      "recommender_name": "Dave Bokil",
      "recommender_title_company": "Director of Product at National Basketball Players Association (NBPA)",
      "text": "Quite simply, Joe is an all-star instructor with a natural ability to lead. I was fortunate to be a student of his at Rutgers University's Coding Bootcamp. Thanks to his enthusiasm and dedication, I was able to quickly comprehend complex JavaScript topics. Speaking as an experienced adjunct college professor, it was inspiring for me to witness Joe in action. He constantly found ways to capture the classroom's attention with ease. Moreover, I respect that his presentation of the material went beyond textbook learning: he is an accomplished developer, and was eager to bring his own invaluable, practical experience to instruction in the classroom.In addition to being an excellent teacher, Joe has a natural ability to lead and mentor teams. I witnessed this firsthand as he effortlessly guided class teams in building full stack web applications. His direction and advice was vital to my success in this endeavor, from application conception to polished minimum viable product. He inspired and pushed my team in directions which enabled us to build the most thorough and modern application that we could.I thoroughly enjoyed being in class with Joe and I'm confident that he would bring the same energy to any position that requires him to lead and motivate a team. I enthusiastically endorse him and recommend you strongly consider him.",
      "date": "August 3, 2017, Dave reported directly to Joe",
      "priority": 7
    },
    {
      "recommender_name": "Diaeddin Motan",
      "recommender_title_company": "Software Engineer at JPMorgan Chase & Co.",
      "text": "I had the honor of being Joseph's student while attending the Rutgers Coding Bootcamp. I think I have never experienced a teacher that is quite as patient and friendly as Joseph. His ability to breakdown difficult concepts and deliver them with enthusiasm is unparalleled.Joseph has the rare ability to empathize with the learner. As a student, being exposed to new technologies and abstract ideas can become overwhelming. By being able to put himself in their shoes, he can guide them through the journey and anticipate problems and pitfalls that may arise. His method was not only to present information but create a path of discovery enabling the student to fully grasp the concepts being discussed.His dedication to his craft is remarkable. Aside from possessing a deep knowledge of the technologies, he is able to deliver the material with enthusiasm while constantly improving his delivery methods by assessing the progress and engagement of the class. By delivering content with humor and providing times to reflect upon the journey, he was able to keep the classes' morale high and focus on point.At no time during the course did I feel that I was on my own. Whether having trouble with a new library or framework, or simply looking for help with my resume or career advice, Joseph was consistently available to answer questions or provide guidance. To say that having Joseph as a teacher was a privilege would be an understatement. I entered RCB with basic knowledge of web technologies and have since been skilled as a confident web developer. His dedication, empathy and enthusiasm for his craft and students are evident in everything he does. I credit him in being instrumental in my journey in web development. I cannot recommend someone more highly.",
      "date": "August 2, 2017, Diaeddin reported directly to Joe",
      "priority": 6
    },
    {
      "recommender_name": "Craig Ramey",
      "recommender_title_company": "Staff Software Engineer at Zip Co",
      "text": "Joe is an excellent instructor at the Rutgers Coding Bootcamp. His ability to take complex topics and convey them in an easy to consume, and concise manner is very impressive.Joe has an experienced understanding of Web Development, which was apparent through the myriad of topics we covered in class. His ability and passion is clearly apparent to his colleagues and enrollees. He is able to motivate and challenge our students, and tends to tailor his approach to meet the needs of each one of them. He has the ability to mentor and guide young developers to the right path without providing them with the answer.He took extra steps outside the classroom to ensure the best experience for the person enrolled in class. When the course culminated with React and Redux, Joe took it upon himself to actually rewrite the curriculum so that the students could have the most up to date educational experience.After projects, Joe took the time to give an in-depth code review to each and every group. The extra hours he dedicated to providing this feedback proved invaluable to the students. The experience of a code review and suggestion of better time management led to a marked improvement in the quality of future work.It was a pleasure working with Joe and I highly recommend him for any managerial engineering role.",
      "date": "July 14, 2017, Craig reported directly to Joe",
      "priority": 6
    }
  ]
}